app/views/assessments/index.html.erb

  <div class="row">
    <% @infraction.fine.each do | fine |%>
---
SELECT  "fines".* FROM "fines" WHERE "fines"."infraction_id" = $1 LIMIT 1  [["infraction_id", 2]]