app/views/infractions/edit.html.erb

SELECT "fines"."law_id" FROM "fines" WHERE "fines"."infraction_id" = $1  [["infraction_id", 1]]
---

        <%  fine = Fine.all.pluck(:law_id) %>