app/views/infractions/new.html.erb

SELECT "laws".* FROM "laws"
---
      <tbody>
        <% Law.all.each do | law | %>