app/views/infractions/show.html.erb

SELECT  "fines".* FROM "fines" WHERE "fines"."infraction_id" = $1 LIMIT 1  [["infraction_id", 1]]
---

        <% @infraction.fine.each do | fine |%>

SELECT "supervisions".* FROM "supervisions" WHERE "supervisions"."infraction_id" = $1  [["infraction_id", 2]]
SELECT COUNT(*) FROM "supervisions" WHERE "supervisions"."infraction_id" = $1  [["infraction_id", 3]]
---
      <legend><i class="zmdi zmdi-view-subtitles"></i> Dados da penalidade</legend>
        <% if not @infraction.supervision.count.zero? %>