app/views/notifications/show.html.erb

        <div class="col-sm-12 notification-view">
          <% @infraction.fine.each do | fine |%>
---
SELECT  "fines".* FROM "fines" WHERE "fines"."infraction_id" = $1 LIMIT 1  [["infraction_id", 2]]

        <div class="col-sm-12 notification-view">
          <% if not @infraction.supervision.count.zero? %>
---
SELECT "supervisions".* FROM "supervisions" WHERE "supervisions"."infraction_id" = $1  [["infraction_id", 2]]
SELECT COUNT(*) FROM "supervisions" WHERE "supervisions"."infraction_id" = $1  [["infraction_id", 2]]