app/controllers/assessments_controller.rb

SELECT  "infractions".* FROM "infractions" WHERE "infractions"."id" = $1 LIMIT 1  [["id", nil]]
---
  def index
    @notification = Infraction.find(params[:id])