app/controllers/infractions_controller.rb

  def index
    @infractions = Infraction.all
---
SELECT "infractions".* FROM "infractions"

  def edit
    @infraction = Infraction.find(params[:id])
    @fine         = Fine.where(infraction_id: params[:id])
---
SELECT  "infractions".* FROM "infractions" WHERE "infractions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "fines".* FROM "fines" WHERE "fines"."infraction_id" = $1  [["infraction_id", 1]]

  def show
    @infraction = Infraction.find(params[:id])
    @fine         = Fine.find_by(infraction_id: params[:id])
---
SELECT  "infractions".* FROM "infractions" WHERE "infractions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "fines".* FROM "fines" WHERE "fines"."infraction_id" = $1  [["infraction_id", 1]]

  def create
    infraction = infraction_params.merge({state: :pending})
    laws         = params.delete(:laws)

    @infraction = Infraction.new(infraction)

    respond_to do |format|
      if @infraction.save
        format.html { redirect_to infractions_path }
        format.json { render :show, status: :created, location: @infraction }

        laws.each do |law|
          Fine.create(infraction_id: @infraction.id, law_id: law)
---
INSERT INTO "infractions" ("owner_name", "owner_identifier", "owner_zip_code", "owner_address", "owner_address_number", "owner_address_complement", "owner_district", "owner_city", "owner_state", "owner_ddd_mobile", "owner_mobile", "owner_ddd_phone", "owner_phone", "property_zone", "property_zip_code", "property_address", "property_address_number", "property_address_complement", "property_district", "property_city", "property_state", "property_meter", "property_block", "property_allotment", "property_observation", "notify_description", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29) RETURNING "id"
SELECT "laws".* FROM "laws"
INSERT INTO "fines" ("notification_id", "law_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["notification_id", 1], ["law_id", 1], ["created_at", "2015-03-23 02:49:35.581705"], ["updated_at", "2015-03-23 02:49:35.581705"]]

  def generate_notification
    @infraction = Infraction.find(params[:id])
    @infraction.notified

    @fine = Fine.find_by(infraction_id: params[:id])
---
SELECT  "infractions".* FROM "infractions" WHERE "infractions"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "fines".* FROM "fines" WHERE "fines"."infraction_id" = $1 LIMIT 1  [["infraction_id", 2]]

  def generate_assessment
    @infraction = Infraction.find(params[:id])
    @infraction.notified

    @fine = Fine.find_by(infraction_id: params[:id])
---
SELECT  "infractions".* FROM "infractions" WHERE "infractions"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "fines".* FROM "fines" WHERE "fines"."infraction_id" = $1 LIMIT 1  [["infraction_id", 5]]

  def set_infraction
    @infraction = Infraction.find(params[:id])
---
SELECT  "infractions".* FROM "infractions" WHERE "infractions"."id" = $1 LIMIT 1  [["id", 2]]