app/controllers/laws_controller.rb

  def index
    @laws = Law.all
---
SELECT "laws".* FROM "laws"

  def create
    @law = Law.new(law_params)

    respond_to do |format|
      if @law.save
---
INSERT INTO "laws" ("number", "article", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def destroy
    @law.destroy
---
DELETE FROM "laws" WHERE "laws"."id" = $1  [["id", 1]]

    def set_law
      @law = Law.find(params[:id])
---
SELECT  "laws".* FROM "laws" WHERE "laws"."id" = $1 LIMIT 1  [["id", 1]]