app/controllers/notifications_controller.rb

  def show
    @infraction = set_notification
    @fine         = Fine.find_by(infraction_id: params[:id])
---
SELECT  "fines".* FROM "fines" WHERE "fines"."infraction_id" = $1 LIMIT 1  [["infraction_id", 2]]

  def print
    @infraction = set_notification
    @fine       = Fine.find_by(infraction_id: params[:id])
---
SELECT  "fines".* FROM "fines" WHERE "fines"."infraction_id" = $1 LIMIT 1  [["infraction_id", 2]]

  def set_notification
    @notification = Infraction.find(params[:id])
---
SELECT  "infractions".* FROM "infractions" WHERE "infractions"."id" = $1 LIMIT 1  [["id", 2]]