app/controllers/supervisions_controller.rb

SELECT "supervisions".* FROM "supervisions"
---
  def index
    @supervisions = Supervision.all

SELECT  "infractions".* FROM "infractions" WHERE "infractions"."id" = $1 LIMIT 1  [["id", 1]]
INSERT INTO "supervisions" ("infraction_id", "observation", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["infraction_id", 1], ["observation", "teste"], ["created_at", "2015-03-23 03:16:58.892025"], ["updated_at", "2015-03-23 03:16:58.892025"]]
---
  def create
    @supervision = Supervision.new(supervision_params)
    @infraction = Infraction.find(supervision_params[:infraction_id])
    respond_to do |format|
      if @supervision.save

SELECT "infractions".* FROM "infractions"
---
  def infractions
    @infractions = Infraction.all

SELECT  "infractions".* FROM "infractions" WHERE "infractions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "fines".* FROM "fines" WHERE "fines"."infraction_id" = $1 LIMIT 1  [["infraction_id", 1]]
---
  def infractions_show
    @infraction = Infraction.find(params[:id])
    @fine         = Fine.find_by(infraction_id: params[:id])

SELECT  "supervisions".* FROM "supervisions" WHERE "supervisions"."id" = $1 LIMIT 1  [["id", 0]]
---
    def set_supervision
      @supervision = Supervision.find(params[:id])