app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])

    @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
UPDATE "users" SET "name" = $1, "user_type" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Steve J"], ["user_type", "administrator"], ["updated_at", "2015-03-31 02:42:17.476100"], ["id", 1]]